<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>D-Fend Reloaded &Uuml;bersetzungseditor</title>
  <meta http-equiv="content-type" content="text/html; charset=iso-8859-1">
  <link rel="stylesheet" type="text/css" href="global.css">
  <script language="JavaScript" type="text/javascript" src="Global.js"></script>
  <meta name="keywords" content="Men&uuml;, Extras, D-Fend Reloaded &Uuml;bersetzungseditor">
</head>
<body>
<Object type="application/x-oleobject" classid="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
	<param name="Keyword" value="Men&uuml;">
  <param name="Keyword" value="Extras">
  <param name="Keyword" value="D-Fend Reloaded &Uuml;bersetzungseditor">
</OBJECT>
  
<p class="content">
Men&uuml;: &nbsp; <b>Extras</b> | <b>Übersetzungseditor</b> | <b>D-Fend Reloaded Übersetzungseditor</b>
</p>

<h1>D-Fend Reloaded &Uuml;bersetzungseditor</h1>

<p>
Der &Uuml;bersetzungseditor unterst&uuml;tzt Sie dabei, D-Fend Reloaded in andere Sprachen zu &uuml;bersetzen.
(Alternative k&ouml;nnen Sie auch einfach eine Kopie einer der <tt>ini</tt>-Sprachdateien in dem Sprachen-Verzeichnis
erstellen und diese Kopie in einem Texteditor bearbeiten, allerdings ist der &Uuml;bersetzungseditor wesentlich
komfortabler.)
</p>

<p>
&Uuml;ber die Auswahlbox oben in dem Dialog k&ouml;nnen Sie die Kategorie, deren Zeichenketten
Sie &uuml;bersetzen wollen, ausw&auml;hlen. Die Tabelle, die den gr&ouml;&szlig;ten Bereich
des Dialogs einnimmt, besteht aus drei Spalten und &auml;ndert Ihren Inhalt in Abh&auml;ngigkeit
von der gew&auml;hlten Kategorie: Im der ersten Spalte stehen die Bezeichner f&uuml;r die jeweiligen
zu &uuml;bersetzenden Zeichenketten. (Dies sind Namen wie "File.Export" f&uuml;r das Wort "Export"
im "Datei"-Men&uuml;.) In der zweiten Spalte steht der jeweilige englische Standardname f&uuml;r
den Bezeichner und in der dritten, editierbaren Spalte k&ouml;nnen Sie den Namen f&uuml;r den Bezeichner
in der neuen Sprache eingeben.
</p>

<p>&nbsp;</p>

<p class="smallH">Siehe dazu auch in der h&auml;ufig gestellten Fragen (FAQs):</p>
<p class="smallT">
  <a href="FAQ.html#FAQ06">Wie kann ich eine andere Sprache f&uuml;r die D-Fend Reloaded Programmoberfl&auml;che erstellen ?</a><br />
  <a href="FAQ.html#FAQ07">Gibt es einen einfachen Weg, eine neue Sprachdatei auf Rechtschreibfehler zu &uuml;berpr&uuml;fen ?</a>
</p>

</body>
</html>