<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>Programeinstellungen | Service</title>
  <meta http-equiv="content-type" content="text/html; charset=iso-8859-1">
  <link rel="stylesheet" type="text/css" href="global.css">
  <script language="JavaScript" type="text/javascript" src="Global.js"></script>
  <meta name="keywords" content="Men&uuml;, Datei, Programeinstellungen, Service">
</head>
<body>
<Object type="application/x-oleobject" classid="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
	<param name="Keyword" value="Men&uuml;">
  <param name="Keyword" value="Datei">
  <param name="Keyword" value="Programeinstellungen">
  <param name="Keyword" value="Service">
</OBJECT>
  
<p class="content">
Men&uuml;: &nbsp; <b>Datei</b> | <b>Programeinstellungen</b>  | <b>Service</b>
</p>

<h1>Programmeinstellungen-Dialogseite "Service"</h1>

<p>
Auf dieser Dialogseite werden (abh&auml;ngig vom jeweils gew&auml;hlten Konfigurationsmodus)
2 bis 5 Service-Funktionen angeboten:
</p>

<ul class="big">
  <li>
    <b>"DOSBox DOS"-Profil wiederherstellen</b><br>
    Diese Funktion stellt das Standardprofil "DOSBox DOS", welches
    ein einfaches DOSBox-Kommandozeilenfenster &ouml;ffent, wieder her.
    Wenn ein Profil mit diesem Namen bereits existiert, so wird es &uuml;berschrieben.
  </li>
  <li>
    <b>Standard-Vorlagen wiederherstellen</b><br />
    Diese Funktion stellt die Vorlagen, die mit D-Fend Reloaded ausgeliefert wurden,
    wieder her.
  </li>
</ul>

<p>
Die folgenden Einstellungen sind nur sichtbar, wenn unten rechts im Programmfenster der
Konfigurationsmodus "Vollst&auml;ndig" gew&auml;hlt ist:
</p>

<ul class="big">  
  <li>
    <b>Alte, nicht mehr genutzte Setup-Dateien von D-Fend v2 l&ouml;schen</b><br />
    D-Fend v2 (classic) verwendete zus&auml;tzlich zu den <tt>prof</tt>-Dateien auch
    noch <tt>conf</tt>-Dateien im Profile-Ordner, um die Spieleprofile zu speichern.
    Au&szlig;erdem legt D-Fend (classic) manchmal tempor&auml;re <tt>Tempprof.*</tt>-Dateien
    im Profileverzeichnis, die es sp&auml;ter nicht mehr l&ouml;scht. Durch diese
    Funktion k&ouml;nnen diese alten, nicht mehr verwendeten Dateien ge&ouml;scht werden.
  </li>
  <li>
    <b>Absolute durch relative Pfade ersetzen</b><br />
    Diese Funktion erm&ouml;glicht es, absolute Pfadangaben wenn m&ouml;glich durch relative
    Pfadangaben zu ersetzen. (Die Verwendung von relariven Pfadangaben ist die Voraussetzung
    f&uuml;r die Verwendung der Funktionen zum <a href="ExtrasTransferProfiles.html">&Uuml;bertragen von Programmen</a>
    und zum <a href="FileExportBuildInstallers.html">Erstellen von Installer-Paketen</a>.)
  </li>  
  <li>
    <b>Pr&uuml;fsummen f&uuml;r alle Profile berechnen</b><br />
    D-Fend Reloaded verwendet Pr&uuml;fsummen, um die Spieledateien auf &Auml;nderungen
    &uuml;berpr&uuml;fen zu k&ouml;nnen. Die Pr&uuml;fsummen werden beim &Ouml;ffnen und
    Schlie&szlig;en des Profileditors sowie beim Starten eines Programmes erstellt (sofern sie
    noch nicht existieren) bzw. &uuml;berpr&uuml;ft (wenn sie bereits existieren). Diese
    Funktion erm&ouml;glicht es, Pr&uuml;fsummen sofort f&uuml;r alle Profile zu erstellen.
  </li>
  <li>
    <b>Paketcache und Paketlisten löschen</b><br />
	Wenn Sie diese Schaltfläche anklicken, werden die heruntergeladenen Paketlisten-Dateien
	sowie alle heruntergeladenen und lokal zwischengespeicherten Datenpakete gelöscht.
	Beim nächsten Aufruf des <a href="FileImportPackage.html">Paketmanagers</a> müssen Sie
	dann die Paketlisten erneut herunterladen.
  </li>
  <li>
    <b>Screenshots-Ordner für alle Profile erstellen</b><br />
	Wenn Sie diesen Button anklicken, werden Screenshots-Verzeichnisse (zum Ablegen der mit DOSBox aufgezeichneten Screenshots, Sounds und Videos) für alle Profile angelegt.
	Wenn für ein Profil noch kein Screenshots-Verzeichnissename festgelegt ist, so wird von dem Profilnamen ein eindeutiger Verzeichnisname abgeleitet.
  </li>
  <li>
    <b>Datenordner für alle Profile erstellen</b><br />
	Wenn Sie diesen Button anklicken, werden Spieledaten-Verzeichnisse (zum Ablegen von Handbuchdateien usw.) für alle Profile angelegt.
	Wenn für ein Profil noch kein Spieledaten-Verzeichnissename festgelegt ist, so wird von dem Profilnamen ein eindeutiger Verzeichnisname abgeleitet.
  </li>
  <li>
    <b>Alle Mediendateien in allen Profilen umbenennen</b><br />
	Benennt alle Screenshots, Sound-Dateien oder aufgezeichneten Videos in allen Profilen gemäß eines
	einstellbaren Schemas um.
  </li>
  <li>
    <b>Mehrere Profile auf Werte aus Vorlagen zurücksetzen</b><br />
	Diese Funktion öffnet den Dialog zum <a href="FileOptionsResetProfiles.html">Zurücksetzen von Profilen</a>.
  </li>
</ul>
 
<p>&nbsp;</p>

<p class="smallH">Siehe auch:</p>
<p class="smallT">
  <a href="FileOptions.html">Programeinstellungen-Dialog</a>
</p>

</body>
</html>