<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>Programeinstellungen | Sicherheit</title>
  <meta http-equiv="content-type" content="text/html; charset=iso-8859-1">
  <link rel="stylesheet" type="text/css" href="global.css">
  <script language="JavaScript" type="text/javascript" src="Global.js"></script>
  <meta name="keywords" content="Men&uuml;, Datei, Programeinstellungen, Sicherheit">
</head>
<body>
<Object type="application/x-oleobject" classid="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
	<param name="Keyword" value="Men&uuml;">
  <param name="Keyword" value="Datei">
  <param name="Keyword" value="Programeinstellungen">
  <param name="Keyword" value="Sicherheit">
</OBJECT>
  
<p class="content">
Men&uuml;: &nbsp; <b>Datei</b> | <b>Programeinstellungen</b>  | <b>Sicherheit</b>
</p>

<h1>Programmeinstellungen-Dialogseite "Sicherheit"</h1>

<p class="small">
Diese Dialogseite ist nur sichtbar, wenn Sie den Konfigurationsmodus "Vollst&auml;ndig" unten im Programmeinstellungen-Dialog gew&auml;hlt haben.
</p>

<p>
Auf dieser Seite k&ouml;nnen die Schutzma&szlig;nahmen gegen das unababsichtigte L&ouml;schen falscher Dateien sowie zum
Schutz der einzelnen Programmdateien konfiguriert werden:
</p>

<ul class="big">
  <li>
    <b>Vor dem L&ouml;schen von Eintr&auml;gen nachfragen</b><br>
    Wenn diese Option aktiviert ist, zeigt D-Fend Reloaded einen Nachfrage/Best&auml;tigungsdialog an, wenn Sie in der
    Spieleliste ein Profil ausw&auml;hlen und <span class="Key">Entf</span> dr&uuml;cken. Ist diese Option deaktiviert,
    so wird das Profil sofort ohne R&uuml;ckfrage gel&ouml;scht.
    <br />(Vorgabewert f&uuml;r diese Option: ein)
  </li>
  <li>
    <b>Beim Deinstallieren von Spielen niemals Dateien au&szlig;erhalb des Basisordners l&ouml;schen</b><br>
    Solange diese Option aktiviert ist, wird D-Fend Reloaded beim Deinstallieren von Spielen
    niemals Dateien au&szlig;erhalb des <a href="FileOptionsDirectories.html">Basisordners</a>
    l&ouml;schen. Wenn diese Option aktiviert ist, kann auch beim Deinstallieren von
    fehlerhaft konfigurierten Spielen keinen Schaden an der normalen Softwareinstallation
    entstehen. Wenn diese Option jedoch deaktiviert ist und Sie ein Spiel deinstallieren
    wollen, welches z.B. <tt>C:\Windows</tt> als seinen Spieleordner angibt, so k&ouml;nnen
    Sie damit ggf. Ihr gesamtes Betriebssystem l&ouml;schen.
    <br />(Vorgabewert f&uuml;r diese Option: ein)
  </li>
  <li>
    <b>DOS-Programmdateien per Pr&uuml;fsumme auf &Auml;nderungen &uuml;berpr&uuml;fen</b><br>
    D-Fend Reloaded kann in jedem Profile Pr&uuml;fsummen zu der Spiele- und der Setup-Programmdatei
    ablegen. Bei jedem Start von Spiel oder Setupprogramm wird dann die gespeicherte
    Pr&uuml;fsumme mit der neuberechneten Pr&uuml;fsumme der Datei verglichen. Wenn die gespeicherte
    Pr&uuml;fsumme nicht mehr zu der Programmdatei passt (und diese Option aktiviert ist),
    gibt D-Fend Reloaded eine Warning aus. Mit Hilfe dieser Funktion k&ouml;nnen &Auml;nderungen
    an Programmdateien, die evtl. durch einen Virus verursacht wurden, erkannt werden und
    es kann erkannt werden, wenn Sie versuchen ein unpassendes Profil (mit ggf.
    unpassenden Einstellungen) auf ein anderes Spiel anzuwenden.
    <br />(Vorgabewert f&uuml;r diese Option: ein)
  </li>
  <li>
    <b>Dateien beim L&ouml;schen in den Papierkorb verschieben</b><br>
    In diesm Feld k&ouml;nnen Sie ausw&auml;hlen, wann D-Fend Reloaded zu l&ouml;schende
    Dateien in den Papierkorb verschieben soll und wann es die Dateien sofort endg&uuml;ltig
    l&ouml;schen soll.
	  <br />(Vorgabewert: Alle nicht tempr&auml;ren Dateien in den Papierkorb verschieben)
  </li>
  <li>
    <b>Im Profileditor anbieten, DOSBox usw. mit Admin-Rechten auszuführen</b><br>	
	Ist diese Option aktiviert, so erscheint im Profileditor eine Auswahlbox, die
	es ermöglicht, DOSBox, ScummVM bzw. das gewählte Windows-Programm mit Administrator-Rechten
	zu starten. Normalerweise sollte dies nicht erforderlich sein. Das Starten eines
	Anwendungsprogramms mit Administrator-Rechten erhöht nur unötig die Gefahr, die
	Softwareinstallation des Systeme zu beschädigen. Die Option hier abgewählt, so
	wird die Funktion im Profileditor nicht nur nicht angeboten, sondern es werden
	Programme, auch wenn dies vorher aktiviert wurde, nicht mit Admin-Rechten gestartet.
	<br />(Vorgabewert für diese Option: aus)
  </li>
</ul>

<p>
<b>Um das Risiko, dass durch Fehlbedienungen oder Programmfehler Sch&auml;den an Ihrer Softwareinstallation auftreten, sollten sie die ersten drei Optionen stets aktiviert lassen.</b>
</p>
 
<p>&nbsp;</p>

<p class="smallH">Siehe auch:</p>
<p class="smallT">
  <a href="FileOptions.html">Programeinstellungen-Dialog</a>
</p>

</body>
</html>