<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>Hinzuf&uuml;gen von Spielen zu D-Fend Reloaded</title>
  <meta http-equiv="content-type" content="text/html; charset=iso-8859-1">
  <link rel="stylesheet" type="text/css" href="global.css">
  <script language="JavaScript" type="text/javascript" src="Global.js"></script>
  <meta name="keywords" content="Einf&uuml;hrung, D-Fend Reloaded, Hinzuf&uuml;gen von Spielen, Spiele">
</head>
<body>
<Object type="application/x-oleobject" classid="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
	<param name="Keyword" value="Einf&uuml;hrung">
  <param name="Keyword" value="Hinzuf&uuml;gen von Spielen">
  <param name="Keyword" value="D-Fend Reloaded">
</OBJECT>

<h1>Hinzuf&uuml;gen von Spielen zu D-Fend Reloaded</h1>

<p class="small">
Als Erstes soll darauf hingewiesen werden, dass es f&uuml;r Erstanwender von D-Fend Reloaded
sehr empfehlenswert ist, die kurze <a href="Introduction.html">Einf&uuml;hrung</a> zu lesen.
Diese erkl&auml;rt die wesentlichen Funktionsweisen von DOSBox und D-Fend Reloaded.
</p>

<p>
Der Text auf dieser Hilfeseite erkl&auml;rt, wie neue Spiele zu D-Fend Reloaded hinzugef&uuml;gt
werden k&ouml;nnen. Es gibt im Wesentlichen zwei Möglichkeiten, Spiele zu der Spieleliste hinzuzufügen:
Vollautomatisch oder assistentengestützt halb-manuell. <b>Um ein Spiel, welches als <tt>zip</tt>-Datei vorliegt
muss, vollautomatisch zur Spieleliste hinzuzufügen, muss die <tt>zip</tt>-Datei lediglich auf das
D-Fend Reloaded Programmfenster gezogen werden.</b> Die <tt>zip</tt>-Datei wird dann in einen neuen Unterordner
des Spieleverzeichnisses entpackt und das Spiel wird (wenn möglich gemäß einer AutoSetup-Vorlage)
vollautomatisch konfiguriert. Wenn Sie jedoch auf die Konfiguration und den genauen Speicherort des
Spiels Einfluss nehmen möchten, so können Sie Spiele gemäß der folgenden zwei Schritte hinzufügen:
</p>

<h2>1. Kopieren der Spieledateien in den Spieleordner</h2>

<ul class="big">
  <li>Klicken Sie auf "Spieleordner &ouml;ffnen..." im "Extras"-Men&uuml;.
  Ein Explorer-Fenster wird sich &ouml;ffnen und Ihnen das Standardverzeichnis
  zum Ablegen von Spielen anzeigen. (Selbstverst&auml;ndlich k&ouml;nnen Sie
  auch jedes beliebige andere Verzeichnis zum Speichenr Ihrer Spiele verwenden,
  aber so lange sie nicht genau wissen, wie die einzelnen D-Fend Reloaded
  Programmfunktionen arbeiten, ist es empfehlenswert, bei diesem Verzeichnis zu bleiben.</li>
  <li>Erstellen Sie einen Unterordner f&uuml;r in diesem Verzeichnis f&uuml;r das neue Spiel.</li>
  <li>Kopieren Sie die Dateien des neuen Spiels in diesen neuen Unterordner.</li>
</ul>

<h2>2. Hinzuf&uuml;gen eines Profils f&uuml;r das neue Spiel</h2>

<ul class="big">
  <li>Klicken Sie auf "Hinzuf&uuml;gen mit Assistent..." im "Profil"-Men&uuml;.</li>
  <li>Der Assistent zur Erstellung neuer Profile wird ge&ouml;ffnet und fragt nach dem Typ des neuen Profils.
  Wenn Sie ein altes DOS-Spiel ausf&uuml;hren wollen, sollten Sie die Voreinstellung "DOSBox" ausgew&auml;hlt lassen.</li>
  <li>Auf der n&auml;chsten Seite fragt der Assitent nach der zu startenden Programmdatei.
  W&auml;hlen Sie hier einfach die Programmdatei aus dem Ordner, den Sie in Schritt 1 angelegt haben aus.
  (Wenn Sie auf die "Datei ausw&auml;hlen"-Schaltfl&auml;che rechts neben dem Eingabefeld f&uuml;r den
  Dateinamen des Spiels klicken, &ouml;ffnet sich ein Dateiauswahl-Dialog direkt und es ist das
  Standardverzeichnis f&uuml;r Spiele bereits ausgew&auml;hlt.)</li>
  <li>Als letzten Schritt m&uuml;ssen Sie jetzt nur noch eine Vorlage f&uuml;r das neue Profil ausw&auml;hlen
  (siehe dazu die Hilfeseite des <a href="ProfileWithWizard.html">Profil-Assistenten</a>).</li>
  <li>Auf den letzten beiden Seiten des Assistenten m&uuml;ssen normalerweise keine manuellen
  Einstellungen vorgenommen werden.</li>
</ul>

<p>&nbsp;</p>

<p class="smallH">Siehe auch:</p>
<p class="smallT">
  <a href="index.html">Inhalt dieser Hilfedatei</a><br />
  <a href="ProfileWizard.html">Profile mit dem Assistenten hinzuf&uuml;gen</a>
</p>

</body>
</html>