<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>Hinzuf&uuml;gen mit Assistent</title>
  <meta http-equiv="content-type" content="text/html; charset=iso-8859-1">
  <link rel="stylesheet" type="text/css" href="global.css">
  <script language="JavaScript" type="text/javascript" src="Global.js"></script>
  <meta name="keywords" content="Men&uuml;, Profil, Hinzuf&uuml;gen mit Assistent">
</head>
<body>
<Object type="application/x-oleobject" classid="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
	<param name="Keyword" value="Men&uuml;">
  <param name="Keyword" value="Profil">
  <param name="Keyword" value="Hinzuf&uuml;gen mit Assistent">
</OBJECT>
  
<p class="content">
Men&uuml;: &nbsp; <b>Profil</b> | <b>Hinzuf&uuml;gen mit Assistent</b>
</p>

<h1>Hinzuf&uuml;gen mit Assistent</h1>

<p>
Mit Hilfe des Assistent des Assistenten k&ouml;nnen Sie auf sehr
einfache Weise neue Profile in D-Fend Reloaded erstellen. Der
Assistenten-Dialog besteht aus fünf Seiten, von denen je nach dem,
welche Informationen D-Fend Reloaded über das Spiel bereits vorliegen,
zwei bis fünf angezeigt werden:
</p>

<h2>Seite 1: Typ des neuen Profils</h2>

<p>
Auf der ersten Seite m&uuml;ssen Sie lediglich festlegen, ob es sich bei dem
neu anzulegenden Profil um ein <b>DOSBox-basierendes Profil, um ein ScummVM-basierendes Profil
oder aber um ein Profil f&uuml;r ein Windows-Spiel</b> handeln soll.
(Die Option "Scumm-basierendes Adventure" wird nur angeboten, wenn Sie im
<a href="FileOptionsScummVM.html">Programmeinstellungen</a>-Dialog den Pfad
zu Ihrer ScummVM-Installation angegeben haben.) Nahezu alle DOS-Spiele k&ouml;nnen
in DOSBox ausgef&uuml;hrt werden; ScummVM kann hingegen nur f&uuml;r
Scumm-Adventures verwendet werden.
</p>

<p>
Zusätzlich können Sie einstellen, wie viele Fragen der Assistent Ihnen stellen soll.
In der Standardeinstellung "<b>Spiel automatisch konfigurieren, wenn eine passende
AutoSetup-Vorlage existiert</b>", wird der Assistent bereits nach den ersten zwei der fünf
Seiten geschlossen, wenn das neue Spiel durch eine AutoSetup-Vorlage eindeutig
identifiziert wurde und keine weiteren Benutzereinstellungen notwendig sind.
Alternativ kann eingestellt werden, dass entweder immer alle fünf Seiten des Assistenten
angezeigt werden sollen oder aber, dass der Assistent auch dann bereits nach der zweiten
Seite geschlossen wird, wenn keine Informationen über das Spiel vorliegen. (In diesem
Fall wird D-Fend Reloaded versuchen, das Spiel gemäß der Standardvorlage zu konfigurieren.)
</p>

<h2>Seite 2: Programmdateien (f&uuml;r neue DOSBox-Profile)</h2>

<p>
Auf dieser Seite k&ouml;nnen Sie die  <b>Programmdatei</b> und optional
eine <b>Setup-Datei</b> f&uuml;r das Profil festlegen. Die auf dieser
Dialogseite festgelegte Programmdatei wird in DOSBox gestartet, wenn Sie
sp&auml;ter auf den Profileintrag in der Spieleliste doppelt klicken.
</p>

<p>
Damit D-Fend Reloaded mit relativen Pfaden arbeiten kann, sollten Sie die Spieledateien
in einem Unterordner des "<b>Empfohlenen &Uuml;bergeordneten Verzeichnisses</b>
ablegen. (Siehe auch <a href="Introduction.html">Einf&uuml;hrung in D-Fend Reloaded</a>
f&uuml;r eine Beschreibung der empfohlenen Verzeichnisstruktur.) Der auf dieser
Dialogseite angebotenen Spieleordner kann auf der
<a href="FileOptionsDirectories.html">Verzeichnisse</a>-Seite des
<a href="FileOptions.html">Programmeinstellungen</a>-Dialogs angepasst werden.
</p>

<p>
Wenn Sie auf <b>Zus&auml;tzliche Dateien manuell konfigurieren</b> klicken, wird
der Dialog um ein Eingabefeld erweitert, &uuml;bder dass Sie einen Ordner
f&uuml;r zus&auml;tzliche Spieledaten wie Handb&uuml;cher usw. konfigurieren
k&ouml;nnen. Der Inhalt dieses Ordners wird sp&auml;ter unten im D-Fend Reloaded
Hauptfenster angezeigt, wenn Sie das Profil in der Spieleliste anklicken.
Alternativ können Sie auch die Option <b>Zusätzliche Datenordner automatisch festlegen</b>
aktivieren. In diesem Fall legt D-Fend Reloaded automatisch basierend auf dem Namen
des Profils einen Datenordner an.
</p>

<h2>Seite 2: Programmdateien (f&uuml;r neue ScummVM-Profile)</h2>

<p>
Auf dieser Seite k&ouml;nnen Sie den <b>Ordner</b> festlegen, in dem
sich das auszuf&uuml;hrende Scumm-Spiel befindet. Der hier angegebene
Ordnername wird ScummVM beim Aufruf &uuml;bergeben.
</p>

<p>
Damit D-Fend Reloaded mit relativen Pfaden arbeiten kann, sollten Sie die Spieledateien
in einem Unterordner des "<b>Empfohlenen &Uuml;bergeordneten Verzeichnisses</b>
ablegen. (Siehe auch <a href="Introduction.html">Einf&uuml;hrung in D-Fend Reloaded</a>
f&uuml;r eine Beschreibung der empfohlenen Verzeichnisstruktur.) Der auf dieser
Dialogseite angebotenen Spieleordner kann auf der
<a href="FileOptionsDirectories.html">Verzeichnisse</a>-Seite des
<a href="FileOptions.html">Programmeinstellungen</a>-Dialogs angepasst werden.
</p>

<p>
In der mit <b>Spiel</b> beschrifteten Auswahlbox k&ouml;nnen Sie einstellen,
f&uuml;r welches Spiel Sie ein Profil erstellen wollen. Die Information, um
welches Spiel es sich handelt wird beim Aufruf ebenfalls an ScummVM &uuml;bergeben.
</p>

<p>
Wenn Sie auf <b>Zus&auml;tzliche Dateien konfigurieren</b> klicken, wird
der Dialog um ein Eingabefeld erweitert, &uuml;bder dass Sie einen Ordner
f&uuml;r zus&auml;tzliche Spieledaten wie Handb&uuml;cher usw. konfigurieren
k&ouml;nnen. Der Inhalt dieses Ordners wird sp&auml;ter unten im D-Fend Reloaded
Hauptfenster angezeigt, wenn Sie das Profil in der Spieleliste anklicken.
</p>

<h2>Seite 2: Programmdateien (f&uuml;r neue Windows-Spiele Profile)</h2>

<p>
Auf dieser Seite k&ouml;nnen Sie die  <b>Programmdatei</b> und optional
eine <b>Setup-Datei</b> f&uuml;r das Profil festlegen. Die auf dieser
Dialogseite festgelegte Programmdatei wird gestartet, wenn Sie
sp&auml;ter auf den Profileintrag in der Spieleliste doppelt klicken.
</p>

<p>
Wenn Sie auf <b>Zus&auml;tzliche Dateien konfigurieren</b> klicken, wird
der Dialog um ein Eingabefeld erweitert, &uuml;bder dass Sie einen Ordner
f&uuml;r zus&auml;tzliche Spieledaten wie Handb&uuml;cher usw. konfigurieren
k&ouml;nnen. Der Inhalt dieses Ordners wird sp&auml;ter unten im D-Fend Reloaded
Hauptfenster angezeigt, wenn Sie das Profil in der Spieleliste anklicken.
</p>

<h2>Seite 3: Einstellungen (f&uuml;r neue DOSBox-Profile)</h2>

<p>
Auf dieser Seite k&ouml;nnen Sie die wichtigsten Einstellungen
f&uuml;r den Start des Spiels in DOSBox vornehmen. Ein Spiel mit
Hilfe des Assistenten zu konfigurieren besteht im Wesentlichen daraus,
eine passende Vorlage f&uuml;r das neue Profil zu w&auml;hlen. Es
gibt insgesamt 5 verschiedene Arten, wie eine Vorlage gew&auml;hlt
werden kann:
</p>

<ul class="big">
  <li>
    <b>Passende Autosetup Vorlage verwenden (empfohlen)</b><br />
    Die Vorlagen in dieser Liste sind kompatibel mit dem gew&auml;hlten
    Spiel. die Kompabilit&auml;t wurde mit Hilfe einer Pr&uuml;fsumme
    festgestellt. Wenn es eine Vorlage in dieser Auswahlbox gibt,
    so wird daher empfohlen, diese zu verwenden.
  </li>
  <li>
    <b>Autosetup Vorlage, welche nur vom Dateinamen her passt, verwenden</b><br />
    Die Vorlagen in dieser Liste sind passen vom Dateinamen her zu dem gew&auml;hlten
    Spiel, nicht jedoch von der Pr&uuml;fsumme her. D.h. dass Sie m&ouml;glicherweise
    eine andere Version des Spieles verwenden, als die, f&uuml;r die die
    Vorlage erstellt wurde. Wenn in der ersten Auswahlbox keine kompatiblen
    Vorlagen angezeigt werden, aber in dieser Auswahlbox eine Vorlage vorhanden
    ist, die auch vom Namen des Spiels her zu passen scheint, so sollten
    Sie diese Vorlage verwenden.
  </li>
  <li>
    <b>Beliebige Autosetup Vorlage verwenden</b><br />
    In dieser Auswahlbox werden unabh&auml;ngig von der gew&auml;hlen Programmdatei
    stets alle Autosetup Vorlagen angezeigt. Wenn in den obigen beiden Auswahlboxen
    keine Eintr&auml;ge vorhanden sind, aber eine der Vorlagen aus dieser Auswahlbox
    den Namen des Spiels, welches Sie gerade hinzuf&uuml;gen wollen tr&auml;gt,
    so k&ouml;nnen Sie diese Vorlage verwenden. Wenn Sie eine dieser Vorlagen
    jedoch auf ein Spiel anwenden, f&uuml;r welches sie nicht erstellt wurde,
    so kann dies dazu f&uuml;hren, dass sich das Spiel nicht starten l&auml;sst.
    Au&szlig;erdem stimmen in diesem Fall die zus&auml;tzlichen Spieleinformationen
    wie Genre, Entwickler usw. nicht.
  </li>
  <li>
    <b>Benutzervorlage verwenden</b><br />
    In dieser Auswahlbox werden unabh&auml;ngig von der gew&auml;hlen Programmdatei
    stets alle benutzerdefinierten Vorlagen angezeigt. Wenn es keine zu Ihrem
    Spiel passende Autosetup Vorlage gibt, so k&ouml;nnen Sie eine dieser Vorlagen
    w&auml;hlen. Diese Vorlagen enthalten keine spielespezifischen Einstellungen
    und es sollte damit m&ouml;glich sein, die meisten Spiele auszuf&uuml;hren.
  </li>
  <li>
    <b>Standard-Assistentenvorlage verwenden</b><br />
    Wenn sie diese Option w&auml;hlen, wird eine fest in den Assistenten
    eingebaute Basis-Vorlage verwendet, die ebenfalls f&uuml;r die meisten
    Spiele verwendbar sein sollte und ebenfalls keine spielespezifischen Einstellungen
    aufweist. &Uuml;ber die Auswahlfelder unterhalb dieser Option k&ouml;nnen Sie
    einige grundlegende Einstellungen an dieser Vorlage vornehmen.
  </li>
</ul>
 
<h2>Seite 3: Einstellungen (f&uuml;r neue ScummVM-Profile)</h2>

<p>
Auf dieser Dialogseite k&ouml;nnen sie einige zus&auml;tzliche
Einstellungen f&uuml;r das neue Profil vornehmen. Welche Einstellungen
hier konkret angeboten werden, h&auml;ngt von dem auf der vorherigen
Seite ausgew&auml;hlten Spiel ab.
</p>

<h2>Seite 4: Spieleinformationen</h2>

<p>
Auf dieser Seite k&ouml;nnen Sie zus&auml;tzliche Informationen
zu dem Spiel (wie Name, Genre, Entwickler, Herausgeber usw.) angeben.
Diese Informationen werden dann in der Spieleliste (im Ansichtsmodus
<a href="ViewModes.html">Details</a>) angezeigt und die
Profile k&ouml;nnen nach diesen Informationen gefiltert werden.
</p>

<p>
&Uuml;ber die "<b>Spiel nachschlagen bei ...</b>" Schaltfl&auml;che k&ouml;nnen
Sie auf nach dem Namen des Profil auf verschiedenen, teilweise auf alte Spiele
spezialisierten Suchmaschinen suchen.
</p>

<p>
Wenn Sie ein DOSBox-Profil hinzuf&uuml;gen und eine Autosetup Vorlage gew&auml;hlt haben,
so wird diese Dialogseite nicht angezeigt, da die Autosetup Vorlagen bereits alle relevanten
Spieleinformationen enthalten.
</p>

<h2>Seite 5: Virtuelle Laufwerke (f&uuml;r neue DOSBox-Profile)</h2>

<p>
Auf dieser Dialogseite werden die virtuellen Laufwerke, die DOSBox verwenden soll, angezeigt.
Die Spiele-Programmdatei muss &uuml;ber eines dieser Laufwerke in DOSBox erreichbar sein,
um gestartet werden zu k&ouml;nnen. D-Fend Reloaded versucht basierend auf dem Pfad des Spieles
und ein Einstellungen in der Vorlage automatisch zu bestimmen, welche virtuellen Laufwerke
anzulegen sind. Wenn die auf dieser Seite angezeigten Laufwerke jedoch f&uuml;r den Start des
Spiels nicht ausreichend sind (z.B. weil zus&auml;tzlich ein CD-Laufwerk verwendet werden soll),
so k&ouml;nnen Sie hier noch &Auml;ndernungen an der Laufwerkskonfiguration vornehmen.
(Selbstverst&auml;ndlich k&ouml;nnen Sie die Konfiguration auch jederzeit sp&auml;ter &uuml;ber
den <a href="ProfileEdit.html">Profileditor</a>-Dialog anpassen.)
</p>
 
<p>&nbsp;</p>

<p class="smallH">Siehe auch:</p>
<p class="smallT">
  <a href="ProfileEdit.html">Profileditor-Dialog</a>
</p>

</body>
</html>