<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>Profileditor | Tastatur</title>
  <meta http-equiv="content-type" content="text/html; charset=iso-8859-1">
  <link rel="stylesheet" type="text/css" href="global.css">
  <script language="JavaScript" type="text/javascript" src="Global.js"></script>
  <meta name="keywords" content="Men&uuml;, Profil, Bearbeiten, Tastatur">
</head>
<body>
<Object type="application/x-oleobject" classid="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
	<param name="Keyword" value="Men&uuml;">
  <param name="Keyword" value="Profil">
  <param name="Keyword" value="Profil bearbeiten">
  <param name="Keyword" value="Bearbeiten">
  <param name="Keyword" value="Tastatur">
</OBJECT>
  
<p class="content">
Men&uuml;: &nbsp; <b>Profil</b> | <b>Bearbeiten</b> | <b>Tastatur</b>
</p>

<h1>Profileditor-Dialogseite "Tastatur"</h1>

<p>
Auf dieser Dialogseite k&ouml;nnen Sie die virtuelle Tastatur und den
Tastaturtreiber, den DOSBox dem Programmen in DOSBox zur Verf&uuml;gung
stellen soll, konfigurieren.
</p>

<ul class="big">
  <li>
    <b>Scan-codes verwenden</b><br />
    &Uuml;ber diese Option k&ouml;nnen Sie steuern, auf welche Art DOSBox abfragen soll,
    ob auf der realen Tastatur eine Taste gedr&uuml;ckt wurde. Das Ein- oder Ausschalten
    dieser Option kann je nach Betriebssystemversion Tastaturprobleme l&ouml;sen oder verursachen.
  </li>
  <li>
    <b>Tastaturbelegung</b><br />
    In dieser Auswahlbox k&ouml;nnen Sie die Tastaturbelegung, die Sie in DOSBox verwenden
    m&ouml;chten, festlegen. Sie sollten hier eine zu Ihrer realen Tastatur passende
    Belegung w&auml;hlen. Die Einstellung "default" bedeutet, dass die Belegung, die für die 
	gewählte DOSBox-Installation bzw. (wenn dort auch "default" angegeben ist) in der
    momentan aktiven D-Fend Reloaded Sprachdatei festgelegt wurde, verwendet wird. (Die konkret
    gew&auml;hlte Tastaturbelegung wird als Informationstext unter der Auswahlbox angezeigt.)
    Die Wahl von "default" f&uuml;hrt beispielsweise zu der Verwendung des Tastaturlayout "US",
    wenn Sie Englisch als Programmsprache gew&auml;hlt haben und zu der Verwendung des
    Tastaturlayouts "GR" (=German), wenn Sie Deutsch als Programmsprache gew&auml;hlt haben usw.
  </li>
  <li>
    <b>Zeichensatz (Codepage)</b><br />
    In diesem Auswahlfeld k&ouml;nnen Sie die in DOSBox zu verwendende Codepage festlegen.
    Die Codepage bestimmt, wie einzelne Zeichen im Textmodus in DOSBox angezeigt werden.
    Die Einstellung "default" bedeutet, dass die Codepage, die für die gewählte DOSBox-Installation
	bzw. (wenn dort auch "default" angegeben ist) die in der momentan aktiven
    D-Fend Reloaded Sprachdatei festgelegt wurde, verwendet wird. (Die konkret
    gew&auml;hlte Codepage wird als Informationstext unter der Auswahlbox angezeigt.)
	<br><b>Achtung:</b>
	Es werden nicht in alle hier angebotenen Codepages für alle Tastaturbelegungen unterstützt.
	Eine Liste der gültigen Tastaturbelegungen und Codepages Kombinationen finden Sie
	<a href="ProfileEditKeyboardList.html">hier</a>.
  </li>  
  <li>
    <b>"Num"-Status</b>, <b>Feststelltaten-Status</b> and <b>"Rollen"-Status</b><br />
    In diesen drei Boxen k&ouml;nnen Sie den anf&auml;nglichen Status der drei Umschalttasten
    Num (f&uuml;r Numerischer Block), Gro&szlig;schreib-Feststell und Rollen festlegen.
    Die Option "Nicht &auml;ndern" bedeutet dabei jeweils, dass DOSBox den von Windows
    vorgegebenen Status der Tasten beim Start beibeh&auml;lt.
  </li>
  <li>
    <b>Standard DOSBox-Tastenzuordnungsdatei verwenden</b><br />
    DOSBox verwendet eine Tastenzuordnungsdatei (key mapping file), um die physikalischen
    Tasten den virtuellen Tasten in DOSBox zu zuordnen. Wenn diese Option aktiviert ist,
    wird in diesem Profil die auf der Dialogseite <a href="FileOptionsDOSBox.html">DOSBox</a>
    des <a href="FileOptions.html">Programmeinstellungen</a>-Dialogs konfigurierte
    Tastenzuordnungsdatei verwendet.
  </li>
  <li>
    <b>Diese benutzerdefinierte DOSBox-Tastenzuordnungsdatei verwenden</b><br />
    Wenn diese Option aktiviert ist, wird statt der standardm&auml;&szlig;igen Tastenzuordnungsdatei
    die hier angegebene Tastenzuordnungsdatei f&uuml;r dieses Profil verwendet.
  </li>
</ul>

<p class="smallH">Hinweis:</p>
<p class="smallT">
Um die Zuordnung der physikalischen Tasten zu den virtuellen Tasten in DOSBox zu
konfigurieren k&ouml;nnen Sie den Keymapper in DOSBox verwenden. Dieser l&auml;sst sich
in DOSBox jeder Zeit &uuml;ber die Tastenkombination <span class="key">Strg</span>+<span class="key">F1</span>
&ouml;ffnen.
</p>

<p>&nbsp;</p>

<p class="smallH">Siehe auch:</p>
<p class="smallT">
  <a href="ProfileEdit.html">Profileditor-Dialog</a><br>
  <a href="ProfileEditKeyboardList.html">Zulässige Tastaturbelegung und Codepage Kombinationen</a>
</p>

</body>
</html>