<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>Schnellstarter anzeigen</title>
  <meta http-equiv="content-type" content="text/html; charset=iso-8859-1">
  <link rel="stylesheet" type="text/css" href="global.css">
  <script language="JavaScript" type="text/javascript" src="Global.js"></script>
  <meta name="keywords" content="Men&uuml;, Ansicht, Schnellstarter anzeigen">
</head>
<body>
<Object type="application/x-oleobject" classid="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
	<param name="Keyword" value="Men&uuml;">
  <param name="Keyword" value="Ansicht">
  <param name="Keyword" value="Schnellstarter anzeigen">
</OBJECT>
  
<p class="content">
Men&uuml;: &nbsp; <b>Ansicht</b> | <b>Schnellstarter anzeigen</b>
</p>

<h1>Schnellstarter anzeigen</h1>
 
<p>
Vom Schnellstarter-Fenster aus k&ouml;nnen Sie direkt DOS-Programme in DOSBox &ouml;ffnen.
Das Schnellstarter-Fesnter hat &Auml;hnlichkeit mit dem Windows Explorer: Auf der linken
Seite befindet sich eine Baumstruktur und auf der rechten Seite eine Dateiliste des
aktuell ausgew&auml;hlten Verzeichnisses.
</p>

<h3>Verzeichnisstruktur</h3>

<p>
In der Verzeichnisstruktur auf der linken Seite des Schnellstarter-Fenstern werden die
Verzeichnis, in denen die Spiele oder zu den Spielen geh&ouml;rende daten gepeichert werden,
angezeigt. &Uuml;ber die Auswahlbox oberhalb der Verzeichnisstruktur k&ouml;nnen Sie w&auml;hlen,
welche Verzeichnisse angezeigt werden soll. In den meisten F&auml;llen ist es &uuml;bersichtlicher,
nicht alle Verzeichnisse anzuzeigen ("Gesamte Verzeichnisstruktur"), sondern nur den
(auf der <a href="FileOptionsDirectories.html">Verzeichnisse</a>-Dialogseite des
<a href="FileOptions.html">Programmeinstellungen</a>-Dialogs definierten) Spieleordner
("Spieleverzeichnis") mit seinen Unterverzeichnissen.
</p>

<p>
Durch das Anklicken eines Verzeichnisses in der Baumstruktur auf der linken Seite
wird der Inhalt dieses Verzeichnisses in der <b>Dateiliste</b> auf der rechten Seite
des Fensters angezeigt.
</p>

<p>
&Uuml;ber das Kontextmen&uuml; der Verzeichnisstruktur k&ouml;nnen Sie auch jedes beliebige
<b>Verzeichnis im Explorer &ouml;ffen</b> bzw. jedes <b>Verzeichnis in DOSBox &ouml;ffnen</b>.
</p>

<h3>Dateiliste</h3>

<p>
Die Dateiliste auf der rechten Seite des Schnellstarter-Fensters zeigt die Dateien in dem
momentan auf der linken Seite gew&auml;hlten Verzeichnis an.
</p>

<p>
Sie k&ouml;nnen jede Datei aus der Dateiliste heraus per Doppelklick direkt <b>&ouml;ffnen</b> bzw. <b>starten</b>.
D-Fend Reloaded bestimmt dann automatisch, auf welche Art die Datei am besten zu starten ist. (Textdateien werden
in dem konfigurierten Texteditor ge&ouml;ffnet, Windows-<tt>exe</tt>-Dateien werden direkt gestartet,
DOS-<tt>exe</tt>-Dateien, <tt>com</tt>-Dateien und <tt>bat</tt>-Dateien werden in DOSBox gestartet
und Bilder, Sounds und Videos werden mit dem jeweils konfigurierten Betrachter ge&ouml;ffnet.
F&uuml;r einige startbare Dateitypen wird im Kontextmen&uuml; zus&auml;tzlich die Option, die Datei
in einem Texteditor zu &ouml;ffnen, statt sie zu starten, angeboten (z.B. f&uuml;r <tt>html</tt>-Dateien
und <tt>bat</tt>-Dateien).
</p>

<p>
Wenn Sie eine Datei vom Schnellstarter aus in DOSBox &ouml;ffnen wird die unten im Schnellstarter-Fenster
ausgew&auml;hlte <b>Vorlage</b> und die zugeh&ouml;rigen <b>Einstellungen</b> verwendet.
</p>

<p>
&Uuml;ber die kontextmen&uuml;funktionen <b>Profil mit Datei erstellen</b> und <b>Profil mit Datei erstellen (Assistent)</b>
k&ouml;nnen Sie direkt ein Profil f&uuml;r das gew&auml;hlte Programm erstellen. Der erste Men&uuml;punkt &ouml;ffnen
den <a href="ProfileAdd.html">Profileditor</a>-Dialog mit der gew&auml;hlten Programmdatei und der (unten im
Schnellstarter-Fenster gew&auml;hlten) Vorlage. Der zweite Men&uuml;punkt &ouml;ffnen den <a href="ProfileWithWizard.html">Assistenten</a>
zum Hinzuf&uuml;gen von Profilen mit der gew&auml;hlten Programmdatei.
</p>

<p>
Dateien und Ordner k&ouml;nnen direk per <b>Drag&amp;Drop</b> in der Dateiliste auf der rechten Seite des
Schnellstarter-Fensters hinzugef&uuml;gt werden.
</p>

<p>&nbsp;</p>

<p class="smallH">Hinweis:</p>
<p class="smallT">
Das Schnellstarter-Fenster ist ein normales Fenster und kein modaler Dialog. Das hei&szlig;t, dass Sie
mit dem D-Fend Reloaded Programmfenster arbeiten k&ouml;nnen (z.B. die anzuzeigenden Profile filtern,
bearbeiten und starten k&ouml;nnen) w&auml;hrend das Schnellstartet-Fenster ge&ouml;ffnet ist.
</p>
 
</body>
</html>